sim2/0/U.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.air;
}
dimensions      [0 1 -1 0 0 0 0];

// internalField에는 uniform이 필수라네... 다시 넣어주자.
internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (4 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    Wall
    {
        type            noSlip;
    }
}
